'''Пользователь вводит число от 1 до 999. Используя операции с числами
сообщите что введено: цифра, двузначное число или трёхзначное число.
📌Для цифры верните её квадрат, например 5 - 25
📌Для двузначного числа произведение цифр, например 30 - 0
📌Для трёхзначного числа его зеркальное отображение, например 520 - 25
📌Если число не из диапазона, запросите новое число
📌Откажитесь от магических чисел
📌В коде должны быть один input и один print'''

while True:
    num = int(input('Введите число от 1 до 999: '))
    if num in range(1, 1000):
        if num < 10:
            result = num ** 2
        elif num < 100:
            result = (num // 10) * (num % 10)
        else:
            edinicy = num % 10
            sotni = (num % 100) // 10
            tisyachi = num // 100
            result = edinicy * 100 + sotni * 10 + tisyachi
        break
    # else:
    #   print('Введите корректное число: ')
print(result)
