# Задача 3
# Дан список чисел. Превратите его в список квадратов этих чисел.

my_list = [1, 2, 3, 4]
res_list = [x * x for x in my_list]
print(res_list)